gdgly/NUC97X_JS/STM32F4xx/CSG/MS/Ethernet.c

#include "../Hcsg/ProjectCSG.h"

#include "../MS/Ethernet.h"
#include "../STM32F4xx/STM32F4xx_MAC.h"
#include "../STM32F4xx/STM32F4xx_IO.h"
#include "../STM32F4xx/STM32F4xx_UART.h"
#include "../Device/LAN8720A.h"
#include "../Device/24AA02E48.h"
#include "../Device/MEMRW.h"
#include "../Display/Display.h"
#include "../Display/Warning.h"
#include "../OS/OS.h"
#include "../Calculate/Calculate.h"
#include "../TEST/LOG.h"



int32_t tcp_cb_client(int32_t socket, netTCP_Event event, NET_ADDR *addr,uint8_t *buf, uint32_t len)
{
	u32 i;
	u32 x;
	u32 p0;
	u32 Max_LEN_BUFF;
	u8 *p8;
	u16 *p16;
  UARTCtrl_TypeDef * UARTCtrl;
	
  UARTCtrl=(UARTCtrl_TypeDef *)(Get_ADDR_UARTnCtrl(ENETPORT));
	
  switch (event) 
	{
    case netTCP_EventConnect:
      // Connect request received
			i=i;
      break;
 
    case netTCP_EventEstablished:
      // Connection established
			p16=(u16 *)(Get_ADDR_UARTnTimer(ENETPORT));
			p16[0]=0;
			UARTCtrl->LinkSubTask=2;//链接子任务
      break;
 
    case netTCP_EventClosed:
      // Connection was properly closed
			p16=(u16 *)(Get_ADDR_UARTnTimer(ENETPORT));
			p16[0]=0;
			UARTCtrl->LinkTask=99;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
			UARTCtrl->LinkSubTask=3;//链接子任务
      break;
 
    case netTCP_EventAborted:
      // Connection is for some reason aborted
			p16=(u16 *)(Get_ADDR_UARTnTimer(ENETPORT));
			p16[0]=0;
			UARTCtrl->LinkSubTask=4;//链接子任务
      break;
 
    case netTCP_EventACK:
      // Previously sent data acknowledged
      break;
 
    case netTCP_EventData:
      // Data received
			p16=(u16*)Get_ADDR_UARTn(ENETPORT);//得到UART缓冲首地址
			Max_LEN_BUFF=Get_LEN_UARTnIntRx(ENETPORT);//得到UART中断接收缓冲长度
			Max_LEN_BUFF-=10;
			p0=p16[0];
			if(p0>=Max_LEN_BUFF)
			{
				p0=0;
			}
			p8=(u8*)((u32)p16)+10;
			while(len)
			{
				x=Max_LEN_BUFF-p0;//当前缓冲到满还可填入字节数
				if(x>len)
				{
					x=len;
				}
				for(i=0;i<x;i++)
				{
					p8[p0]=buf[i];
					p0++;
				}
				buf+=x;
				len-=x;
				if(p0>=Max_LEN_BUFF)
				{
					p0=0;
				}
			}
			p16[0]=p0;
      break;
  }
  return (0);
}
uint32_t udp_callback(int32_t socket, const NET_ADDR *addr, const uint8_t *buf, uint32_t len)
{
  // This function is called when UDP data is received 
  // Process received data from 'buf' 
	u32 i;
	u32 x;
	u32 p0;
	u32 Max_LEN_BUFF;
	u8 *p8;
	u16 *p16;
  UARTCtrl_TypeDef * UARTCtrl;
	
	UARTCtrl=(UARTCtrl_TypeDef *)(Get_ADDR_UARTnCtrl(ENETPORT));
	if(UARTCtrl->LinkSubTask==6)//链接子任务
	{
		//case 6://ETH死机检查等待接收
		for(i=0;i<16;i++)
		{
			if(buf[i]!=i)
			{
				break;
			}
		}
		if(i>=16)
		{
			UARTCtrl->LinkSubTask++;//接收OK
		}
		return (0);
	}
	p16=(u16*)Get_ADDR_UARTn(ENETPORT);//得到UART缓冲首地址
	Max_LEN_BUFF=Get_LEN_UARTnIntRx(ENETPORT);//得到UART中断接收缓冲长度
	Max_LEN_BUFF-=10;
	p0=p16[0];
	if(p0>=Max_LEN_BUFF)
	{
		p0=0;
	}
	p8=(u8*)((u32)p16)+10;
	while(len)
	{
		x=Max_LEN_BUFF-p0;//当前缓冲到满还可填入字节数
		if(x>len)
		{
			x=len;
		}
		for(i=0;i<x;i++)
		{
			p8[p0]=buf[i];
			p0++;
		}
		buf+=x;
		len-=x;
		if(p0>=Max_LEN_BUFF)
		{
			p0=0;
		}
	}
	p16[0]=p0;
  return (0);
}
uint32_t tcp_cb_server (int32_t socket, netTCP_Event event,const NET_ADDR *addr, const uint8_t *buf, uint32_t len)
{   
	switch (event)
	{    
		case netTCP_EventConnect:
			// Connect request received 
			// Example
//			if (addr->addr_type == NET_ADDR_IP4)
//			{ // IPv4 client
//				if (addr->addr[0] == 192  &&
//						addr->addr[1] == 168  &&
//						addr->addr[2] == 0    &&
//						addr->addr[3] == 1)
//				{// Accept connection from client at 192.168.0.1 
//					return (1);
//				}
//			}
//			else
//			{// IPv6 client
//				const uint8_t ip6_addr[NET_ADDR_IP6_LEN] = {0xfe, 0x80, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
//																										0x1c, 0x30, 0x6c, 0xff, 0xfe, 0xa2, 0x45, 0x5e };
//				if (memcmp (addr->addr, ip6_addr, NET_ADDR_IP6_LEN) == 0)
//				{// Accept connection from client at [fe80::1c30:6cff:fea2:455e]
//					return (1);
//				}
//			}
//			// Deny connection.
//			return (0);

			return (1);
		case netTCP_EventEstablished:
			// Connection established
			break;
		case netTCP_EventClosed:
			// Connection was properly closed
			break;
		case netTCP_EventAborted:
			// Connection is for some reason aborted
			break;
		case netTCP_EventACK:
			// Previously sent data acknowledged
			break;
		case netTCP_EventData:
			// Data received

			break;
	} 
	return (0);
}

/*
u32 IP4_ASCII(u8 *hex,u8 *ascii)//填写ip4 ascii,出口:0=没变化,1=变化
{
	u32 i;
	u32 x;
	u32 f;
	
	f=0;//0=没变化
	for(x=0;x<4;x++)
	{
		i=*hex;
		i=hex_bcd(i);
		if(i<0x10)
		{
			if(ascii[0]!=(i+0x30))
			{
				f=1;
				ascii[0]=i+0x30;
			}
			if(x<3)
			{//不是第4字节
				if(ascii[1]!='.')
				{
					f=1;
					ascii[1]='.';
				}
			}
			ascii+=2;
			hex++;
			continue;
		}
		if(i<0x100)
		{
			if(ascii[0]!=((i>>4)+0x30))
			{
				f=1;
				ascii[0]=(i>>4)+0x30;
			}
			if(ascii[1]!=((i&0xf)+0x30))
			{
				f=1;
				ascii[1]=(i&0xf)+0x30;
			}
			if(x<3)
			{//不是第4字节
				if(ascii[2]!='.')
				{
					f=1;
					ascii[2]='.';
				}
			}
			ascii+=3;
			hex++;
			continue;
		}
		if(ascii[0]!=((i>>8)+0x30))
		{
			f=1;
			ascii[0]=(i>>8)+0x30;
		}
		if(ascii[1]!=(((i>>4)&0xf)+0x30))
		{
			f=1;
			ascii[1]=((i>>4)&0xf)+0x30;
		}
		if(ascii[2]!=((i&0xf)+0x30))
		{
			f=1;
			ascii[2]=(i&0xf)+0x30;
		}
		if(x<3)
		{//不是第4字节
			if(ascii[3]!='.')
			{
				f=1;
				ascii[3]='.';
			}
		}
		ascii+=4;
		hex++;
	}
	ascii--;
	ascii[0]=0;
	
	return f;
}
#if MainProtocol==376
u32 Local_ASCII_IP4(void)//填写本地ascii ip,出口:0=没变化,1=变化
{
	u32 i;
	u32 x;
	u32 f;
	u8 *p8s;
	u8 *p8d;
	
	f=0;//0=没变化
//MAC ascii
 #if IC_24AAxxx==1
	Read_24AA02E48(ADDR_DATABUFF,0xFA,6);//24AAxxx读
	MW(ADDR_DATABUFF,ADDR_TERMINAL+10,6);
 #else
	MR(ADDR_DATABUFF,ADDR_TERMINAL+10,6);
 #endif
	p8s=(u8*)ADDR_DATABUFF;
	p8d=(u8*)ADDR_MACADDR_ascii;
	for(i=0;i<6;i++)
	{
		if((p8s[i]>>4)<=9)
		{
			x=(p8s[i]>>4)+0x30;
		}
		else
		{
			x=(p8s[i]>>4)+55;
		}
		if(p8d[0]!=x)
		{
			f=1;//1=变化
			p8d[0]=x;
		}
		if((p8s[i]&0xf)<=9)
		{
			x=(p8s[i]&0xf)+0x30;
		}
		else
		{
			x=(p8s[i]&0xf)+55;
		}
		if(p8d[1]!=x)
		{
			f=1;//1=变化
			p8d[1]=x;
		}
		p8d[2]='-';
		p8d+=3;
	}
	p8d--;
	p8d[0]=0;
//本机IP4 ascii
	MR(ADDR_DATABUFF,ADDR_AFN04F7,4);
	f|=IP4_ASCII((u8 *)ADDR_DATABUFF,(u8 *)ADDR_IP4ADDR_ascii);//填写ip4 ascii,出口:0=没变化,1=变化
//本机IP4子网掩码 ascii
	MR(ADDR_DATABUFF,ADDR_AFN04F7+4,4);
	f|=IP4_ASCII((u8 *)ADDR_DATABUFF,(u8 *)ADDR_IP4MASK_ascii);//填写ip4 ascii,出口:0=没变化,1=变化
//本机IP4网关IP ascii
	MR(ADDR_DATABUFF,ADDR_AFN04F7+8,4);
	f|=IP4_ASCII((u8 *)ADDR_DATABUFF,(u8 *)ADDR_IP4GATEWAY_ascii);//填写ip4 ascii,出口:0=没变化,1=变化
//本机IP4 PRIMARY_DNS ascii
	MWR(192+(168<<8)+(3<<16)+(1<<24),ADDR_DATABUFF,4);
	f|=IP4_ASCII((u8 *)ADDR_DATABUFF,(u8 *)ADDR_IP4PRIMARY_DNS_ascii);//填写ip4 ascii,出口:0=没变化,1=变化
//本机IP4 SECONDARY_DNS ascii
	MWR(192+(168<<8)+(3<<16)+(1<<24),ADDR_DATABUFF,4);
	f|=IP4_ASCII((u8 *)ADDR_DATABUFF,(u8 *)ADDR_IP4SECONDARY_DNS_ascii);//填写ip4 ascii,出口:0=没变化,1=变化

	return f;
}
#else//#if MainProtocol==376
u32 Local_ASCII_IP4(void)//填写本地ascii ip,出口:0=没变化,1=变化
{
	u32 i;
	u32 x;
	u32 f;
	u8 *p8s;
	u8 *p8d;
	
	f=0;//0=没变化
//MAC ascii
 #if IC_24AAxxx==1
	Read_24AA02E48(ADDR_DATABUFF,0xFA,6);//24AAxxx读
	//MW(ADDR_DATABUFF,ADDR_TERMINAL+10,6);
 #else
	MR(ADDR_DATABUFF,ADDR_4510_5+2,6);
 #endif
	p8s=(u8*)ADDR_DATABUFF;
	p8d=(u8*)ADDR_MACADDR_ascii;
	for(i=0;i<6;i++)
	{
		if((p8s[i]>>4)<=9)
		{
			x=(p8s[i]>>4)+0x30;
		}
		else
		{
			x=(p8s[i]>>4)+55;
		}
		if(p8d[0]!=x)
		{
			f=1;//1=变化
			p8d[0]=x;
		}
		if((p8s[i]&0xf)<=9)
		{
			x=(p8s[i]&0xf)+0x30;
		}
		else
		{
			x=(p8s[i]&0xf)+55;
		}
		if(p8d[1]!=x)
		{
			f=1;//1=变化
			p8d[1]=x;
		}
		p8d[2]='-';
		p8d+=3;
	}
	p8d--;
	p8d[0]=0;
//本机IP4 ascii
	MR(ADDR_DATABUFF,ADDR_4510_4+6,4);
	f|=IP4_ASCII((u8 *)ADDR_DATABUFF,(u8 *)ADDR_IP4ADDR_ascii);//填写ip4 ascii,出口:0=没变化,1=变化
//本机IP4子网掩码 ascii
	i=(u32)Get_Element((u8*)ADDR_4510_4,3,0,LENmax_4510_4);//计算元素地址,使用ADDR_128K_DATABUFF
	if(i)
	{
		MR(ADDR_DATABUFF,i+2,4);
	}
	else
	{
		MWR(255+(255<<8)+(255<<16)+(0<<24),ADDR_DATABUFF,4);
	}
	f|=IP4_ASCII((u8 *)ADDR_DATABUFF,(u8 *)ADDR_IP4MASK_ascii);//填写ip4 ascii,出口:0=没变化,1=变化
//本机IP4网关IP ascii
	i=(u32)Get_Element((u8*)ADDR_4510_4,4,0,LENmax_4510_4);//计算元素地址,使用ADDR_128K_DATABUFF
	if(i)
	{
		MR(ADDR_DATABUFF,i+2,4);
	}
	else
	{
		MWR(192+(168<<8)+(3<<16)+(1<<24),ADDR_DATABUFF,4);
	}
	f|=IP4_ASCII((u8 *)ADDR_DATABUFF,(u8 *)ADDR_IP4GATEWAY_ascii);//填写ip4 ascii,出口:0=没变化,1=变化
//本机IP4 PRIMARY_DNS ascii
	MWR(192+(168<<8)+(3<<16)+(1<<24),ADDR_DATABUFF,4);
	f|=IP4_ASCII((u8 *)ADDR_DATABUFF,(u8 *)ADDR_IP4PRIMARY_DNS_ascii);//填写ip4 ascii,出口:0=没变化,1=变化
//本机IP4 SECONDARY_DNS ascii
	MWR(192+(168<<8)+(3<<16)+(1<<24),ADDR_DATABUFF,4);
	f|=IP4_ASCII((u8 *)ADDR_DATABUFF,(u8 *)ADDR_IP4SECONDARY_DNS_ascii);//填写ip4 ascii,出口:0=没变化,1=变化

	return f;
}
#endif

void Ethernet_RxTx(void)
{
	u32 i;
	u32 x;
	u32 sourMACMIIDR;
	u8 *p8s;
	u8 *p8d;
	u16 * p16timer;
	os_Type *os;
	NET_ADDR *addr;
  UARTCtrl_TypeDef * UARTCtrl;
	netStatus ns;
	
  UARTCtrl=(UARTCtrl_TypeDef *)(Get_ADDR_UARTnCtrl(ENETPORT));
	p16timer=(u16 *)(Get_ADDR_UARTnTimer(ENETPORT));
	
	if(UARTCtrl->LinkTask<101)//101://登录ok
	{
		if(Comm_Ram->CheckLEDTimer<=(1000/10))//3000/10;//上电全部LED检查显示 每10MS减1定时器
		{
			Pin_OutH(PIN_ENET_LINK_LED);//引脚输出低,入口引脚使用名
		}
	}
	switch(UARTCtrl->LinkTask)
	{
		case 0://0=延时关机
			if(p16timer[0]==0x0)
			{
				UARTCtrl->LinkTask++;
			}
			return;
		case 1://1=关电源
			UnInit_STM32F4xx_MAC();
		#if MainProtocol==376
			if(Comm_Ram->TYMDHMS[2]==0)
		#else
			if(Comm_Ram->DL698YMDHMS[2]==0)
		#endif
			{//是0时,关电源
				OffE5V0();//关E5V0电源
				p16timer[0]=5000/10;//关闭电源延时5秒
			}
			else
			{//不是0时,不关电源
				p16timer[0]=2000/10;//延时2秒
			}
			UARTCtrl->LinkTask++;
			return;
		case 2://开电源,ETH系统初始化
			if(Comm_Ram->After_Init_OS&(1<<4))//OS重启后使用标志:B0=软件更新,B1=FS,B2=USB0,B3=USB1,B4=ETH,B5=,B6=,B7=其他
			{
				Comm_Ram->Init_OS|=1<<4;//OS需重启原因标志:B0=软件更新,B1=FS,B2=USB0,B3=USB1,B4=ETH,B5=,B6=,B7=其他
				return;
			}
			Terminal_Ram->ENETSEL=0;//以太网模块选择0=,1=,2=,3=RJ45没插入1次,4=没插入2次,5=没插入5次,6=
			if(Comm_Ram->POWER<3)//电源:0=电池供电,1=电网供电转电池供电重启动,2=电网供电转电池供电,3=电网供电
			{
				//本机端口号,同时用于掉电时已连接过1次识别
				if(UARTCtrl->PORT==0)
				{
					UARTCtrl->PORT=1;
				}
				else
				{
					return;//电池供电时连接1次后停止
				}
			}
			if(UARTCtrl->LinkCtrl!=1)//连接控制0=不连接,1=连接
			{
				return;
			}
			//开电源
			if(p16timer[0]!=0x0)
			{
				if(p16timer[0]<(2000/10))
				{
					if(Pin_Read(PIN_ENE5V0)==0)//读引脚,入口引脚使用名;返回0或1	
					{
						OnE5V0();//打开E5V0电源
						if(p16timer[0]<(1000/10))
						{
							p16timer[0]=1000/10;//至少1s延时
						}
					}
				}
				return;
			}
			if(Pin_Read(PIN_ENE5V0)==0)//读引脚,入口引脚使用名;返回0或1	
			{
				OnE5V0();//打开E5V0电源
				p16timer[0]=1000/10;//1s延时
				return;
			}
			//ETH系统初始化
			Init_STM32F4xx_MAC();
			Init_LAN8720A();
			p16timer[0]=2000/10;//等待电缆RJ45插入2s延时
			i=Read_ETH_PHYReg(PHYAddr_LAN8720A_0,2);
			if(i!=7)
			{
				Comm_Ram->ErrorIC|=0x80;//硬件错误B7=LAN8720
				Comm_Ram->DisplayAllErrorTimer=10;//上电全显或系统错误显示秒定时器
				UARTCtrl->LinkTask=0;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
				return;
			}
			Local_ASCII_IP4();//填写本地ascii ip4,出口:0=没变化,1=变化
			
			os=Get_os();
			os->netInitialize();//每次重启OS后只能调用初始化1次,否则死机
			Comm_Ram->After_Init_OS|=(1<<4);//OS重启后使用标志:B0=软件更新,B1=FS,B2=USB0,B3=USB1,B4=ETH,B5=,B6=,B7=其他
			UARTCtrl->DHCPTask=0;//DHCP任务号
			UARTCtrl->TCPSocket=os->netTCP_GetSocket((netTCP_cb_t)tcp_cb_client);
			if(UARTCtrl->TCPSocket<0)
			{
				Comm_Ram->Init_OS|=1<<4;//OS需重启原因标志:B0=软件更新,B1=FS,B2=USB0,B3=USB1,B4=ETH,B5=,B6=,B7=其他
				return;
			}
			UARTCtrl->UDPSocket=os->netUDP_GetSocket((netUDP_cb_t)udp_callback);
			if(UARTCtrl->UDPSocket<0)
			{
				Comm_Ram->Init_OS|=1<<4;//OS需重启原因标志:B0=软件更新,B1=FS,B2=USB0,B3=USB1,B4=ETH,B5=,B6=,B7=其他
				return;
			}
			UARTCtrl->LinkTask++;
			return;
		case 3://等待电缆RJ45插入(每2秒检测)
			if(p16timer[0]==0x0)
			{
				p16timer[0]=2000/10;//下次检测定时
				Disable_os();//暂停os
				while(ETH->MACMIIAR&1)
				{//MDC正忙
				}
				sourMACMIIDR=ETH->MACMIIDR;//原值保护
				i=Read_ETH_PHYReg(PHYAddr_LAN8720A_0,1);
				ETH->MACMIIDR=sourMACMIIDR;//原值恢复
				Enable_os();//允许os
				if(i&(1<<2))//bit2 link is up,bit5 auto-negotiate process completed
				{//RJ45插入
					if(Terminal_Ram->ENETSEL>=4)//以太网模块选择0=,1=,2=,3=RJ45没插入1次,4=没插入2次,5=没插入5次,6=
					{
						WarningCancel(ENETPORT);//告警取消,入口告警代码
					}
					Terminal_Ram->ENETSEL=0;//以太网模块选择0=,1=,2=,3=RJ45没插入1次,4=没插入2次,5=没插入5次,6=
				#if MainProtocol==376
					i=MRR(ADDR_AFN04F8,1);
				#else
					i=MRR(ADDR_4510_2+5,1);//连接方式  enum{TCP（0），UDP（1）}
					i<<=7;
				#endif
					UARTCtrl->TCPUDP=i;
					if(Comm_Ram->Factory==0x55)
					{//工厂模式时登录不加随机延时方便工厂生产测试
						p16timer[0]=0;//5000/10;//0;//至小延时5秒,滨江新大楼发现<=3秒内不能连接
					}
					else
					{
					#if MainProtocol==376
						i=MRR(ADDR_TERMINAL,1);//终端地址的低1字节作为随机数
						i&=0x0f;
						i*=100;
						if(i<500)
						{
							i+=500;//至小延时5秒,滨江新大楼发现<=3秒内不能连接
						}
						p16timer[0]=i;
					#else//#if MainProtocol==376
						p16timer[0]=0;
					#endif
					}
					UARTCtrl->LinkSubTask=0;//链接子任务
					UARTCtrl->LinkTask++;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
				}
				else
				{
					if(Terminal_Ram->ENETSEL<3)//以太网模块选择0=,1=,2=,3=RJ45没插入1次,4=没插入2次,5=没插入5次,6=
					{
						Terminal_Ram->ENETSEL=3;//以太网模块选择0=,1=,2=,3=RJ45没插入1次,4=没插入2次,5=没插入5次,6=
					}
					else
					{//第二次判断
						if(Terminal_Ram->ENETSEL<5)//以太网模块选择0=,1=,2=,3=RJ45没插入1次,4=没插入2次,5=没插入5次,6=
						{
							Terminal_Ram->ENETSEL++;//以太网模块选择0=,1=,2=,3=RJ45没插入1次,4=没插入2次,5=没插入5次,6=
						}
						WarningOccur(ENETPORT,(u8 *)"以太网电缆被拨出");//告警发生,入口告警代码和告警字符串
					}
				}
			}
			return;
		case 4://
		case 5://
		case 6://
			UARTCtrl->LinkTask++;
			return;
		case 7://连接随机延时1-30秒
			if(p16timer[0]==0x0)
			{
				UARTCtrl->LinkTask=99;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
			}
			return;
		case 99://连接
			os=Get_os();
		#if MainProtocol==376
			i=MRR(ADDR_AFN04F7+64,1);
			if(i==0x0)
			{//固定IP连接
				if(Local_ASCII_IP4())//填写本地ascii ip4,出口:0=没变化,1=变化
				{
					Comm_Ram->Init_OS|=1<<4;//OS需重启原因标志:B0=软件更新,B1=FS,B2=USB0,B3=USB1,B4=ETH,B5=,B6=,B7=其他
					return;
				}
			}
			else
			{//自动获取IP连接
				switch(UARTCtrl->DHCPTask)//DHCP任务号
				{
					case 0://启动DHCP
						ns=os->netDHCP_Enable(0);
						if(ns!=netOK)
						{
							Comm_Ram->Init_OS|=1<<4;//OS需重启原因标志:B0=软件更新,B1=FS,B2=USB0,B3=USB1,B4=ETH,B5=,B6=,B7=其他
							return;
						}
						WarningOccur(ENETPORT,(u8 *)"以太网正在自动获取IP");//告警发生,入口告警代码和告警字符串
						p16timer[0]=60000/10;//等待超时60s
						UARTCtrl->DHCPTask=1;//DHCP任务号
						return;
					case 1://等待DHCP
						if(p16timer[0]==0)
						{//超时
							Comm_Ram->Init_OS|=1<<4;//OS需重启原因标志:B0=软件更新,B1=FS,B2=USB0,B3=USB1,B4=ETH,B5=,B6=,B7=其他
						}
						return;
					case 2://DPCH完成
						p16timer[0]=0;
						UARTCtrl->DHCPTask=3;//DHCP任务号
						break;
					case 3://连接
						break;
					default:
						UARTCtrl->DHCPTask=0;//DHCP任务号
						return;
				}
			}
		#else//#if MainProtocol==376
			//IP配置方式enum{DHCP（0），静态（1），PPPoE（2）}
			i=MRR(ADDR_4510_4+3,1);
			if(i==1)
			{//静态（1）
				if(Local_ASCII_IP4())//填写本地ascii ip4,出口:0=没变化,1=变化
				{
					Comm_Ram->Init_OS|=1<<4;//OS需重启原因标志:B0=软件更新,B1=FS,B2=USB0,B3=USB1,B4=ETH,B5=,B6=,B7=其他
					return;
				}
			}
			else
			{
				if(i==0)
				{//{DHCP（0）
					switch(UARTCtrl->DHCPTask)//DHCP任务号
					{
						case 0://启动DHCP
							ns=os->netDHCP_Enable(0);
							if(ns!=netOK)
							{
								Comm_Ram->Init_OS|=1<<4;//OS需重启原因标志:B0=软件更新,B1=FS,B2=USB0,B3=USB1,B4=ETH,B5=,B6=,B7=其他
								return;
							}
							WarningOccur(ENETPORT,(u8 *)"以太网正在自动获取IP");//告警发生,入口告警代码和告警字符串
							p16timer[0]=60000/10;//等待超时60s
							UARTCtrl->DHCPTask=1;//DHCP任务号
							return;
						case 1://等待DHCP
							if(p16timer[0]==0)
							{//超时
								Comm_Ram->Init_OS|=1<<4;//OS需重启原因标志:B0=软件更新,B1=FS,B2=USB0,B3=USB1,B4=ETH,B5=,B6=,B7=其他
							}
							return;
						case 2://DPCH完成
							p16timer[0]=0;
							UARTCtrl->DHCPTask=3;//DHCP任务号
							break;
						case 3://连接
							break;
						default:
							UARTCtrl->DHCPTask=0;//DHCP任务号
							return;
					}
				}
				else
				{//PPPoE（2）
					
					
