gdgly/NUC97X_JS/STM32F4xx/CSG/MS/Ethernet.c
				}
			}
		#endif
			if (p16timer[0]!=0x0)
			{
				return;
			}
			switch(UARTCtrl->LinkSubTask)//链接子任务
			{
				case 0://发起连接
					UARTCtrl->Task=0;//0=正在接收
					UARTCtrl->Lock=0;//0x55=通信功能正在被调用禁止其他程序再次调用
					UARTCtrl->RxByte=0;//接收字节数=0
					UARTCtrl->HostACK=0;//主动上报需主站确认帧标记:0=无,1=登录帧,2=退出登录帧,3=心跳帧,4=重要事件,5=定时任务
					UARTCtrl->HeartberatCount=0;//心跳发出计数,收到确认帧清0
					Terminal_Ram->ENETHeartBeat_S_Timer=0;//心跳发出秒定时器
					UARTCtrl->LinkTask2=0;//通道2链接任务(FTP命令);0-99=过程,100=建立连接
					UARTCtrl->Task2=0;//通道2任务(FTP命令)
					
					//本机端口号,同时用于掉电时已连接过1次识别
					i=UARTCtrl->PORT;
					i++;
					if((i<SocketPortnMin)||(i>SocketPortnMax))
					{
						i=SocketPortnMin;
					}
					UARTCtrl->PORT=i;
					//主站IP
					addr=(NET_ADDR *)&UARTCtrl->NET_ADDR;
					if((UARTCtrl->TCPUDP&0x80)==0x0)
					{//TCP
						addr->addr_type = NET_ADDR_IP4;
					#if MainProtocol==376
						if(UARTCtrl->LinkCount<2)
						{//主IP
							MR((u32)&addr->addr[0],ADDR_AFN04F3,4);
							MR((u32)&addr->port,ADDR_AFN04F3+4,2);
						}
						else
						{//备用IP
							MR((u32)&addr->addr[0],ADDR_AFN04F3+6,4);
							MR((u32)&addr->port,ADDR_AFN04F3+6+4,2);
						}
					#else
						i=MRR(ADDR_4510_3+1,1);
						if((UARTCtrl->LinkCount<2)||(i<2))
						{//主IP
							i=(u32)Get_Element((u8*)ADDR_4510_3,1,1,LENmax_4510_3);//计算元素地址,使用ADDR_128K_DATABUFF
							if(i)
							{
								MR((u32)&addr->addr[0],i+2,4);
							}
							else
							{
								MWR(192+(168<<8)+(3<<16)+(1<<24),(u32)&addr->addr[0],4);
							}
							i=(u32)Get_Element((u8*)ADDR_4510_3,1,2,LENmax_4510_3);//计算元素地址,使用ADDR_128K_DATABUFF
							if(i)
							{
								i=MRR(i+1,2);
								i=(i>>8)+((i&0xff)<<8);
								addr->port=i;
							}
							else
							{
								addr->port=1024;
							}
						}
						else
						{//备用IP
							i=(u32)Get_Element((u8*)ADDR_4510_3,1,3,LENmax_4510_3);//计算元素地址,使用ADDR_128K_DATABUFF
							if(i)
							{
								MR((u32)&addr->addr[0],i+2,4);
							}
							else
							{
								MWR(192+(168<<8)+(3<<16)+(1<<24),(u32)&addr->addr[0],4);
							}
							i=(u32)Get_Element((u8*)ADDR_4510_3,1,4,LENmax_4510_3);//计算元素地址,使用ADDR_128K_DATABUFF
							if(i)
							{
								i=MRR(i+1,2);
								i=(i>>8)+((i&0xff)<<8);
								addr->port=i;
							}
							else
							{
								addr->port=1024;
							}
						}
					#endif
						os->netTCP_Close(UARTCtrl->TCPSocket);
						ns=os->netTCP_Connect(UARTCtrl->TCPSocket,addr,UARTCtrl->PORT);
						if(ns!=netOK)
						{
							Comm_Ram->Init_OS|=1<<4;//OS需重启原因标志:B0=软件更新,B1=FS,B2=USB0,B3=USB1,B4=ETH,B5=,B6=,B7=其他
							return;
						}
						p16timer[0]=30000/10;//连接超时定时;Net_Config_TCP.h中重试定义#define TCP_MAX_RETRY 5,#define TCP_RETRY_TOUT 4;5*4=20秒
						UARTCtrl->LinkSubTask=1;//链接子任务
					}
					else
					{//UDP
						os->netUDP_Close(UARTCtrl->UDPSocket);
						ns=os->netUDP_Open(UARTCtrl->UDPSocket,UARTCtrl->PORT);
						if(ns!=netOK)
						{
							Comm_Ram->Init_OS|=1<<4;//OS需重启原因标志:B0=软件更新,B1=FS,B2=USB0,B3=USB1,B4=ETH,B5=,B6=,B7=其他
							return;
						}
						WarningCancel(ENETPORT);//告警取消,入口告警代码
						p16timer[0]=0;//连接超时定时;Net_Config_TCP.h中重试定义#define TCP_MAX_RETRY 5,#define TCP_RETRY_TOUT 4;5*4=20秒
						UARTCtrl->LinkSubTask=0;//链接子任务
						UARTCtrl->LinkTask=100;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
					}
					return;
				case 1://等待连接
					if(p16timer[0]==0x0)
					{//连接超时
						if(UARTCtrl->LinkSubTask==1)//链接子任务没在tcp_cb_client()变化,tcp_cb_client()事件会设置LinkSubTask同时设置p16timer[0]=0
						{
							UARTCtrl->LinkCount++;//连接计数+1
							if(UARTCtrl->LinkCount>=3)
							{
								UARTCtrl->LinkCount=0;
								//ETH死机检查
								UARTCtrl->LinkSubTask=5;//链接子任务5=RJ45插入,ETH死机检查
								return;
							}
							UARTCtrl->LinkSubTask=0;//链接子任务
						}
					}
					return;
				case 2://case netTCP_EventEstablished:
					//WarningOccur(ENETPORT,(u8 *)"以太网链接建立");//告警发生,入口告警代码和告警字符串
					WarningCancel(ENETPORT);//告警取消,入口告警代码
					p16timer[0]=0;
					UARTCtrl->LinkSubTask=0;//链接子任务
					UARTCtrl->LinkTask=100;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
					return;
				case 3://case netTCP_EventClosed:
					WarningOccur(ENETPORT,(u8 *)"以太网链接被断开");//告警发生,入口告警代码和告警字符串
					p16timer[0]=1000/10;//1秒后重连
					UARTCtrl->LinkSubTask=0;//链接子任务
					return;
				case 4://case netTCP_EventAborted:
//						if(UARTCtrl->LinkCount<2)
//						{//主IP
//							WarningOccur(ENETPORT,(u8 *)"以太网链接主IP失败");//告警发生,入口告警代码和告警字符串
//						}
//						else
//						{//备用IP
//							WarningOccur(ENETPORT,(u8 *)"以太网链接备用IP失败");//告警发生,入口告警代码和告警字符串
//						}
					WarningOccur(ENETPORT,(u8 *)"以太网链接主站失败");//告警发生,入口告警代码和告警字符串
					UARTCtrl->LinkSubTask=1;//链接子任务
					return;
					
				case 5://RJ45插入,ETH死机检查
					Disable_os();//暂停os
					while(ETH->MACMIIAR&1)
					{//MDC正忙
					}
					sourMACMIIDR=ETH->MACMIIDR;//原值保护
					i=Read_ETH_PHYReg(PHYAddr_LAN8720A_0,1);
					if((i&(1<<2))==0)//bit2 link is up,bit5 auto-negotiate process completed
					{//RJ45拨出
						ETH->MACMIIDR=sourMACMIIDR;//原值恢复
						Enable_os();//允许os
						UARTCtrl->LinkTask=3;//等待电缆RJ45插入(每2秒检测)
						return;
					}
					i=Read_ETH_PHYReg(PHYAddr_LAN8720A_0,0);
					Write_ETH_PHYReg(PHYAddr_LAN8720A_0,0,i|(1<<14));//bit14 loopback mode
					ETH->MACMIIDR=sourMACMIIDR;//原值恢复
					Enable_os();//允许os
					
					addr=(NET_ADDR *)&UARTCtrl->NET_ADDR;
					addr->addr_type = NET_ADDR_IP4;
					addr->addr[0] =255;//广播地址,不能用本机地址测试
					addr->addr[1] =255;
					addr->addr[2] =255;
					addr->addr[3] =255;
					addr->port =1024;
					ns=os->netUDP_Open(UARTCtrl->UDPSocket,1024);
					if(ns)
					{
						ns=ns;
					}
					p8s=os->netUDP_GetBuffer(16);
					if((u32)p8s==0)
					{
						Comm_Ram->Init_OS|=1<<4;//OS需重启原因标志:B0=软件更新,B1=FS,B2=USB0,B3=USB1,B4=ETH,B5=,B6=,B7=其他
						return;
					}
					for(i=0;i<16;i++)
					{
						p8s[i]=i;
					}
					ns=os->netUDP_Send(UARTCtrl->UDPSocket,addr,p8s,16);
					if(ns)
					{
						ns=ns;
					}
					p16timer[0]=1000/10;//超时定时
					UARTCtrl->LinkSubTask=6;//链接子任务
					return;
				case 6://ETH死机检查等待接收
					if(p16timer[0]==0x0)
					{//接收超时
						WarningOccur(ENETPORT,(u8 *)"以太网内循接测试失败");//告警发生,入口告警代码和告警字符串
						Comm_Ram->Init_OS|=1<<4;//OS需重启原因标志:B0=软件更新,B1=FS,B2=USB0,B3=USB1,B4=ETH,B5=,B6=,B7=其他
					}
					return;
				case 7://接收OK
					os->netUDP_Close(UARTCtrl->UDPSocket);
					Disable_os();//暂停os
					while(ETH->MACMIIAR&1)
					{//MDC正忙
					}
					sourMACMIIDR=ETH->MACMIIDR;//原值保护
					i=Read_ETH_PHYReg(PHYAddr_LAN8720A_0,0);
					i&=~(1<<14);
					Write_ETH_PHYReg(PHYAddr_LAN8720A_0,0,i);//bit14 loopback mode
					ETH->MACMIIDR=sourMACMIIDR;//原值恢复
					Enable_os();//允许os
					UARTCtrl->LinkSubTask=0;//链接子任务
					return;
				default:
					UARTCtrl->LinkSubTask=0;//链接子任务
					return;
			}
			//return;
		case 100://连接ok
			break;
		case 101://登录ok
			Pin_OutL(PIN_ENET_LINK_LED);//引脚输出低,入口引脚使用名
			break;
		case 102://发退出登录
			break;
		case 103://退出登录
			if(Comm_Ram->POWER==3)//电源:0=电池供电,1=电网供电转电池供电重启动,2=电网供电转电池供电,3=电网供电
			{//电网有电则重新登录,电网掉电则保持
				UARTCtrl->LinkTask=3;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
			}
			return;
		case 104://关机
			Comm_Ram->Init_OS|=1<<4;//OS需重启原因标志:B0=软件更新,B1=FS,B2=USB0,B3=USB1,B4=ETH,B5=,B6=,B7=其他
			p16timer[0]=2000/10;//关机延时2s(与GPRS模块相同时间)
			return;
		default:
			UARTCtrl->LinkTask=0;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
			return;
	}

//连接ok,登录ok

