gdgly/NUC97X_JS/STM32F4xx/CSG/MS/Ethernet.c
	if(Terminal_Ram->ENETCheck_S_Timer==0)//4 以太网IP冲突检查和租赁更新秒定时器
	{
		//经实测暂停os到允许os需24us
		Terminal_Ram->ENETCheck_S_Timer=2;
		Disable_os();//暂停os
		while(ETH->MACMIIAR&1)
		{//MDC正忙
		}
		sourMACMIIDR=ETH->MACMIIDR;//原值保护
		i=Read_ETH_PHYReg(PHYAddr_LAN8720A_0,1);
		ETH->MACMIIDR=sourMACMIIDR;//原值恢复
		Enable_os();//允许os
		if((i&(1<<2))==0)//bit2 link is up,bit5 auto-negotiate process completed
		{//RJ45拨出
			UARTCtrl->LinkTask=3;//等待电缆RJ45插入(每2秒检测)
			return;
		}
	#if MainProtocol==376
		i=MRR(ADDR_AFN04F7+64,1);
		if(i==0x0)
		{//固定IP连接
			if(Local_ASCII_IP4())//填写本地ascii ip4,出口:0=没变化,1=变化
			{
				Comm_Ram->Init_OS|=1<<4;//OS需重启原因标志:B0=软件更新,B1=FS,B2=USB0,B3=USB1,B4=ETH,B5=,B6=,B7=其他
				return;
			}
		}	
	#else
		//IP配置方式enum{DHCP（0），静态（1），PPPoE（2）}
		i=MRR(ADDR_4510_4+3,1);
		if(i==1)
		{//静态（1）
			if(Local_ASCII_IP4())//填写本地ascii ip4,出口:0=没变化,1=变化
			{
				Comm_Ram->Init_OS|=1<<4;//OS需重启原因标志:B0=软件更新,B1=FS,B2=USB0,B3=USB1,B4=ETH,B5=,B6=,B7=其他
				return;
			}
		}	
	#endif
	}

	switch(UARTCtrl->Task)
	{
		case 0://接收
			//在线控制
			if(UARTCtrl->LinkCtrl==0)//连接控制0=不连接,1=连接
			{
				if(UARTCtrl->LinkTask==101)//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
				{
					UARTCtrl->LinkTask=102;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
					UARTCtrl->HeartberatCount=0;//心跳发出计数,收到确认帧清0
					Terminal_Ram->ENETHeartBeat_S_Timer=0;//2 以太网心跳秒定时器
					return;
				}
			}
			break;
		case 2://等待单帧数据发送
		case 5://等待多帧数据发送
		#if (USER/100)==11//吉林系
			USER11xx_TxAddr(PORTn);//吉林系发送帧终端地址2字节长度变为4字节,并重新计算帧校验和,需发送的帧字节数+2
		#endif
		#if LOG_1376_1==1//0=没,1=有
			LOG(13761,1,ENETPORT,(u8 *)Get_ADDR_UARTnTx(ENETPORT),UARTCtrl->TxByte,0);//入口:TR=0接收=1发送;protocol=13761,13762,13763,6451997,6452007;ascii=0为hex码=1本身为ascii码
		#endif
			UARTCtrl->TxCount=0;
			p16timer[0]=30000/10;//30秒,等待发送数据给主站时间超时定时
			UARTCtrl->Task++;
			break;
		case 3://发送单帧数据正在发送
		case 6://多帧数据正在发送
			if(UARTCtrl->TxByte)
			{
				os=Get_os();
				if((UARTCtrl->TCPUDP&0x80)==0x0)
				{//TCP
					if(os->netTCP_SendReady(UARTCtrl->TCPSocket))
					{//准备好发送
						x=os->netTCP_GetMaxSegmentSize(UARTCtrl->TCPSocket);
						if(x>UARTCtrl->TxByte)
						{
							x=UARTCtrl->TxByte;
						}
						p8d=os->netTCP_GetBuffer(x);
						if((u32)p8d==0)
						{
							if(p16timer[0]==0)//60秒,等待发送数据给主站时间超时定时
							{
								UARTCtrl->LinkTask=3;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
							}
							break;
						}
						p8s=(u8*)Get_ADDR_UARTnTx(ENETPORT);
						p8s+=UARTCtrl->TxCount;
						for(i=0;i<x;i++)
						{
							p8d[i]=p8s[i];
						}
						UARTCtrl->TxByte-=x;
						UARTCtrl->TxCount+=x;
						os->netTCP_Send(UARTCtrl->TCPSocket,p8d,x);
						Terminal_Ram->ENETLED_MS_Timer=50/10;//14 以太网接收发送LED指示MS定时器,每10MS减1定时器
					}
					else
					{
						if(p16timer[0]==0)//60秒,等待发送数据给主站时间超时定时
						{
							UARTCtrl->LinkTask=3;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
						}
					}
				}
				else
				{//UDP
					x=1440;
					if(x>UARTCtrl->TxByte)
					{
						x=UARTCtrl->TxByte;
					}
					p8d=os->netUDP_GetBuffer(x);
					if((u32)p8d==0)
					{
						if(p16timer[0]==0)//60秒,等待发送数据给主站时间超时定时
						{
							UARTCtrl->LinkTask=3;//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
						}
						break;
					}
					p8s=(u8*)Get_ADDR_UARTnTx(ENETPORT);
					p8s+=UARTCtrl->TxCount;
					for(i=0;i<x;i++)
					{
						p8d[i]=p8s[i];
					}
					UARTCtrl->TxByte-=x;
					UARTCtrl->TxCount+=x;
					addr=(NET_ADDR *)&UARTCtrl->NET_ADDR;
					addr->addr_type = NET_ADDR_IP4;
				#if MainProtocol==376
					MR((u32)&addr->addr[0],ADDR_AFN04F3,4);
					MR((u32)&addr->port,ADDR_AFN04F3+4,2);
				#else
					i=(u32)Get_Element((u8*)ADDR_4510_3,1,1,LENmax_4510_3);//计算元素地址,使用ADDR_128K_DATABUFF
					if(i)
					{
						MR((u32)&addr->addr[0],i+2,4);
					}
					else
					{
						MWR(192+(168<<8)+(3<<16)+(1<<24),(u32)&addr->addr[0],4);
					}
					i=(u32)Get_Element((u8*)ADDR_4510_3,1,2,LENmax_4510_3);//计算元素地址,使用ADDR_128K_DATABUFF
					if(i)
					{
						i=MRR(i+1,2);
						i=(i>>8)+((i&0xff)<<8);
						addr->port=i;
					}
					else
					{
						addr->port=1024;
					}
				#endif
					os->netUDP_Send(UARTCtrl->UDPSocket,addr,p8d,x);
					Terminal_Ram->ENETLED_MS_Timer=50/10;//14 以太网接收发送LED指示MS定时器,每10MS减1定时器
				}
			}
			else
			{
				if(UARTCtrl->Task==3)
				{
					UARTCtrl->Task=7;//7=等待发送器空转为接收
				}
				else
				{
					UARTCtrl->Task=4;//4=多帧数据续接收完成
				}
			}
			break;
	}
}

*/


















